# 데이터프레임 그룹 분석

In [8]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [10]:
df1.pivot("도시", "연도", "인구")
# 행 인덱스, 열 인덱스, 데이터

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [11]:
df1.pivot(["지역","도시"], "연도", "인구")

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

## 그룹분석

In [12]:
iris = sns.load_dataset('iris')
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [13]:
iris.groupby(iris.species).agg(['mean', 'std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [14]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [16]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [17]:
df2.groupby(df2.key1)['data2'].sum()

key1
A    80
B    70
Name: data2, dtype: int64

### egg() 메서드

In [18]:
def peak_to_peak_ratio(x):
      return x.max() / x.min()

In [19]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [20]:
mpg = sns.load_dataset('mpg')
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [21]:
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])

In [22]:
mpg.head()

    mpg  cylinders  displacement  ...  origin                       name  manufacturer
0  18.0          8         307.0  ...     usa  chevrolet chevelle malibu     chevrolet
1  15.0          8         350.0  ...     usa          buick skylark 320         buick
2  18.0          8         318.0  ...     usa         plymouth satellite      plymouth
3  16.0          8         304.0  ...     usa              amc rebel sst           amc
4  17.0          8         302.0  ...     usa                ford torino          ford

[5 rows x 10 columns]

In [23]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)


iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
iris[["petal_length", "petal_length_class"]].tail(10)

     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

### pivot_table

In [24]:
df1.pivot('도시','연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [25]:
df1.pivot_table('인구','도시','연도')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [26]:
df1.pivot_table('인구','도시','연도', margins=True, margins_name="합계")

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [27]:
df1.pivot_table('인구',['지역','도시'],'연도', margins=True, margins_name="합계")

연도           2005       2010       2015            합계
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0  3.451492e+06
수도권 서울  9762546.0  9631482.0  9904312.0  9.766113e+06
    인천        NaN   263203.0  2890451.0  1.576827e+06
합계      6637546.5  4429292.0  5414500.0  5.350809e+06

### tips dataset 사례

In [34]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [35]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.tail()

     total_bill   tip     sex smoker   day    time  size   tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [36]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [38]:
tips.groupby('sex').count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [39]:
# NaN 데이터가 없을 때
tips.groupby('sex').size()

sex
Male      157
Female     87
dtype: int64

In [41]:
# 성별에 따른 평균 팁 비율
tips.groupby('sex')[['tip_pct']].mean()

         tip_pct
sex
Male    0.157651
Female  0.166491

In [44]:
# 흡연여부에 따른 평균 팁 비율
tips.groupby('smoker')[['tip_pct']].mean()

         tip_pct
smoker
Yes     0.163196
No      0.159328

In [47]:
# 성별과 흡연 여부에 따른 평균 팁 비율
tips.groupby(['sex','smoker'])[['tip_pct']].mean()

                tip_pct
sex    smoker
Male   Yes     0.152771
       No      0.160669
Female Yes     0.182150
       No      0.156921

In [48]:
tips.pivot_table('tip_pct', ['sex', 'smoker'])

                tip_pct
sex    smoker
Male   Yes     0.152771
       No      0.160669
Female Yes     0.182150
       No      0.156921

In [49]:
# 리스트를 없애면
tips.pivot_table('tip_pct', 'sex', 'smoker')

smoker       Yes        No
sex
Male    0.152771  0.160669
Female  0.182150  0.156921

In [50]:
# 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.
# 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

In [51]:
# 요일
tips.groupby('day')[['tip_pct']].mean()

       tip_pct
day
Thur  0.161276
Fri   0.169913
Sat   0.153152
Sun   0.166897

In [52]:
# 점심/저녁 여부
tips.groupby('time')[['tip_pct']].mean()

         tip_pct
time
Lunch   0.164128
Dinner  0.159518

In [53]:
# 요일 + 점심/저녁 여부
tips.groupby(['day','time'])[['tip_pct']].mean()

              tip_pct
day  time
Thur Lunch   0.161301
     Dinner  0.159744
Fri  Lunch   0.188765
     Dinner  0.158916
Sat  Lunch        NaN
     Dinner  0.153152
Sun  Lunch        NaN
     Dinner  0.166897

In [57]:
tips.pivot_table('tip_pct', ['time', 'size'], 'day')

day              Thur       Fri       Sat       Sun
time   size
Lunch  1     0.181728  0.223776       NaN       NaN
       2     0.164024  0.181969       NaN       NaN
       3     0.144599  0.187735       NaN       NaN
       4     0.145515       NaN       NaN       NaN
       5     0.121389       NaN       NaN       NaN
       6     0.173706       NaN       NaN       NaN
Dinner 1          NaN       NaN  0.231832       NaN
       2     0.159744  0.162659  0.155289  0.180870
       3          NaN       NaN  0.151439  0.152662
       4          NaN  0.117750  0.138289  0.153168
       5          NaN       NaN  0.106572  0.159839
       6          NaN       NaN       NaN  0.103799

In [58]:
tips.groupby(['day','time'])[['tip_pct']].agg(lambda x: x.max()/x.min())

               tip_pct
day  time
Thur Lunch    3.650035
     Dinner   1.000000
Fri  Lunch    2.202532
     Dinner   2.544342
Sat  Lunch         NaN
     Dinner   9.140009
Sun  Lunch         NaN
     Dinner  11.949266

In [60]:
tips.groupby(['sex','smoker'])[['tip_pct']].agg(lambda x: x.max()/x.min())

                 tip_pct
sex    smoker
Male   Yes     19.932154
       No       4.066490
Female Yes      7.383333
       No       4.448720

In [63]:
def peak2peak(x):
  return x.max() / x.min()
tips.groupby(['sex','smoker'])[['tip_pct']].agg('mean', 'peak2peak')

                tip_pct
sex    smoker
Male   Yes     0.152771
       No      0.160669
Female Yes     0.182150
       No      0.156921